# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3 
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor() #Your code here

## Display the names of all the employees in Boston.

In [3]:
import pandas as pd
cur.execute('''SELECT firstName, lastName FROM employees JOIN offices using(officeCode) WHERE city = 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head(10) #Your code here

Number of results: 2

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?

In [20]:
cur.execute('''SELECT officeCode, count(employeeNumber) FROM offices JOIN employees using(officeCode) group by officeCode;''').fetchall() #Your code here

[('1', 6), ('2', 2), ('3', 2), ('4', 5), ('5', 2), ('6', 4), ('7', 2)]

## Write 3 Questions of your own and answer them

In [22]:
#Which 3 customers had the most orders?
cur.execute('''SELECT customerName, count(orderNumber) FROM customers JOIN orders using(customerNumber) group by customerNumber LIMIT 3;''').fetchall()

[('Atelier graphique', 3),
 ('Signal Gift Stores', 3),
 ('Australian Collectors, Co.', 5)]

In [23]:
#Which 5 customers spent the most?
cur.execute('''SELECT customerName, sum(amount) FROM customers JOIN payments using (customerNumber) group by customerNumber LIMIT 5;''').fetchall()

[('Atelier graphique', 22314.36),
 ('Signal Gift Stores', 80180.98),
 ('Australian Collectors, Co.', 180585.07),
 ('La Rochelle Gifts', 116949.68000000001),
 ('Baane Mini Imports', 104224.79)]

In [50]:
#What were the 5 most popular products?
cur.execute('''SELECT productName, count(orderNumber) FROM products JOIN orderdetails using(productCode) group by productCode LIMIT 5;''').fetchall() # Your code here

[('1969 Harley Davidson Ultimate Chopper', 28),
 ('1952 Alpine Renault 1300', 28),
 ('1996 Moto Guzzi 1100i', 28),
 ('2003 Harley-Davidson Eagle Drag Bike', 28),
 ('1972 Alfa Romeo GTA', 28)]

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [52]:
df = pd.DataFrame(cur.execute('''SELECT firstName, lastName, productName 
            FROM employees e
            JOIN customers c
            on e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders using(customerNumber)
            JOIN orderdetails using(orderNumber)
            JOIN products using(productCode)''').fetchall())
df.head()
print(len(df))

2996

## Level Up: Display the Number of Products each Employee Has sold

In [62]:
df = pd.DataFrame(cur.execute('''SELECT firstName, lastName, count(productCode) 
            FROM employees e
            JOIN customers c
            on e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders using(customerNumber)
            JOIN orderdetails using(orderNumber)
            JOIN products using(productCode) 
            group by (employeeNumber)
            ORDER BY firstName''').fetchall())
df #Your code here

           0          1    2
0       Andy     Fixter  185
1      Barry      Jones  220
2   Foon Yue      Tseng  142
3     George     Vanauf  211
4     Gerard  Hernandez  396
5      Julie   Firrelli  124
6      Larry       Bott  236
7     Leslie   Jennings  331
8     Leslie   Thompson  114
9       Loui     Bondur  177
10      Mami      Nishi  137
11    Martin     Gerard  114
12    Pamela   Castillo  272
13     Peter      Marsh  185
14     Steve  Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!